load_tests/results/full_setup/test_10_requests/jmeter.log
START Running Jmeter on Mon Sep  8 10:45:00 CEST 2025
JVM_ARGS=-Xmn188m -Xms752m -Xmx752m
jmeter args=-n -t /load_tests/load_test.jmx -l /load_tests/results/full_setup/test_10_requests/jmeter.jtl -Jusers=10 -Jloops=1 -Jtestname=test_10_requests -Jsummariser.interval=10 -Jsummariser.out=true
jmeter ALL ARGS=-Dlog4j2.formatMsgNoLookups=true -n -t /load_tests/load_test.jmx -l /load_tests/results/full_setup/test_10_requests/jmeter.jtl -Jusers=10 -Jloops=1 -Jtestname=test_10_requests -Jsummariser.interval=10 -Jsummariser.out=true
Creating summariser <summary>
Created the tree successfully using /load_tests/load_test.jmx
Starting standalone test @ September 8, 2025 10:45:06 AM CEST (1757321106214)
Waiting for possible Shutdown/StopTestNow/HeapDump/ThreadDump message on port 4445
summary +      2 in 00:00:04 =    0.5/s Avg:   604 Min:   421 Max:   788 Err:     0 (0.00%) Active: 1 Started: 2 Finished: 1
summary +      4 in 00:00:11 =    0.4/s Avg:   320 Min:   214 Max:   460 Err:     0 (0.00%) Active: 1 Started: 6 Finished: 5
summary =      6 in 00:00:15 =    0.4/s Avg:   415 Min:   214 Max:   788 Err:     0 (0.00%)
summary +      3 in 00:00:09 =    0.3/s Avg:   737 Min:   293 Max:  1385 Err:     0 (0.00%) Active: 1 Started: 9 Finished: 8
summary =      9 in 00:00:25 =    0.4/s Avg:   522 Min:   214 Max:  1385 Err:     0 (0.00%)
summary +      1 in 00:00:03 =    0.4/s Avg:   229 Min:   229 Max:   229 Err:     0 (0.00%) Active: 0 Started: 10 Finished: 10
summary =     10 in 00:00:27 =    0.4/s Avg:   493 Min:   214 Max:  1385 Err:     0 (0.00%)
Tidying up ...    @ September 8, 2025 10:45:34 AM CEST (1757321134511)
... end of run
END Running Jmeter on Mon Sep  8 10:45:34 CEST 2025